
## Plan Result (management/domains)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2937203258)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_route53_record.portfolio
  * module.root_domain.aws_route53_zone.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_route53_record.portfolio will be created
  + resource "aws_route53_record" "portfolio" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "portfolio.tqer39.com"
      + records         = [
          + "ns-1366.awsdns-42.org.",
          + "ns-1761.awsdns-28.co.uk.",
          + "ns-500.awsdns-62.com.",
          + "ns-958.awsdns-55.net.",
        ]
      + ttl             = 30
      + type            = "NS"
      + zone_id         = (known after apply)
    }

  # module.root_domain.aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "tqer39.com"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/domains"
        }
      + zone_id       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":144,"Program":"tfcmt","SHA1":"c79708182080c6b5acc6c16a87dbb633fb7c4672","Target":"management/domains","Vars":{},"WorkflowName":"Terraform - AWS - Management"} -->